contact-service/src/main/resources/wsdl/ContactCenter.wsdl

<definitions targetNamespace="http://schemas.hp.com/SM/7" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:cmn="http://schemas.hp.com/SM/7/Common" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns="http://schemas.hp.com/SM/7" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/wsdl/  http://schemas.xmlsoap.org/wsdl/"><types><xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://schemas.hp.com/SM/7" version="2020-03-19 Rev 0" xmlns="http://schemas.hp.com/SM/7" xmlns:cmn="http://schemas.hp.com/SM/7/Common" xmlns:xmime="xmlmime"><xs:import namespace="xmlmime" schemaLocation="xmlmime"/><xs:import namespace="http://schemas.hp.com/SM/7/Common" schemaLocation="Common.xsd"/><xs:complexType name="ContactCenterKeysType"><xs:sequence><xs:element minOccurs="0" name="CallID" nillable="true" type="cmn:StringType"/></xs:sequence><xs:attribute name="query" type="xs:string" use="optional"/><xs:attribute name="updatecounter" type="xs:long" use="optional"/></xs:complexType><xs:complexType name="ContactCenterInstanceType"><xs:sequence><xs:element minOccurs="1" name="CallID" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ServiceRecipient" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Urgency" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="OpenTime" nillable="true" type="cmn:DateTimeType"/><xs:element minOccurs="0" name="UpdateTime" nillable="true" type="cmn:DateTimeType"/><xs:element minOccurs="0" name="OpenedBy" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Description"><xs:complexType><xs:complexContent><xs:extension base="cmn:ArrayType"><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="Description" type="cmn:StringType"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType></xs:element><xs:element minOccurs="0" name="AffectedService" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CallOwner" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Status" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="NotifyBy" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Solution"><xs:complexType><xs:complexContent><xs:extension base="cmn:ArrayType"><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="Solution" type="cmn:StringType"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType></xs:element><xs:element minOccurs="0" name="AssignmentGroup"><xs:complexType><xs:complexContent><xs:extension base="cmn:ArrayType"><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="AssignmentGroup" type="cmn:StringType"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType></xs:element><xs:element minOccurs="0" name="Category" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CallerDepartment" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CallerLocation" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CloseTime" nillable="true" type="cmn:DateTimeType"/><xs:element minOccurs="0" name="ClosedBy" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="KnowledgeCandidate" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="SLAAgreementID" nillable="true" type="cmn:IntType"/><xs:element minOccurs="0" name="Priority" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ServiceContract" nillable="true" type="cmn:IntType"/><xs:element minOccurs="0" name="SiteCategory" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="TotalLossOfService" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="Area" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Subarea" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ProblemType" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="FailedEntitlement" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="Phase" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CauseCode" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ClosureCode" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Company" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ReportedByContact" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ReportedByDifferentContact" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="ReportedByPhone" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ReportedByExtension" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ReportedByFax" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactEmail" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="LocationFullName" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactFirstName" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactLastName" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactTimeZone" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="EnteredByESS" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="SLABreached" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="NextSLABreach" nillable="true" type="cmn:DateTimeType"/><xs:element minOccurs="0" name="Contact" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactPhone" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Update"><xs:complexType><xs:complexContent><xs:extension base="cmn:ArrayType"><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="Update" type="cmn:StringType"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType></xs:element><xs:element minOccurs="0" name="Impact" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="needed.by.time" nillable="true" type="cmn:DateTimeType"/><xs:element minOccurs="0" name="approval.status" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="folder" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="subscriptionItem" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactFullName" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="AffectedCI" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Title" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Assignee" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="CallOrigin" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactCompanyName" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactEID" nillable="true" type="cmn:LongType"/><xs:element minOccurs="0" name="ContactIdType" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactMobilePhone" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ContactQID" nillable="true" type="cmn:LongType"/><xs:element minOccurs="0" name="External" nillable="true" type="cmn:BooleanType"/><xs:element minOccurs="0" name="ContactPassportNumber" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="ServiceCategory" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="Location" nillable="true" type="cmn:StringType"/><xs:element minOccurs="0" name="attachments" nillable="true" type="cmn:AttachmentsType"/></xs:sequence><xs:attribute name="query" type="xs:string" use="optional"/><xs:attribute name="uniquequery" type="xs:string" use="optional"/><xs:attribute name="recordid" type="xs:string" use="optional"/><xs:attribute name="updatecounter" type="xs:long" use="optional"/></xs:complexType><xs:complexType name="ContactCenterModelType"><xs:sequence><xs:element name="keys" type="ContactCenterKeysType"/><xs:element name="instance" type="ContactCenterInstanceType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="query" type="xs:string" use="optional"/></xs:complexType><xs:element name="RetrieveContactCenterRequest"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/></xs:sequence><xs:attribute name="attachmentInfo" type="xs:boolean" use="optional"/><xs:attribute name="attachmentData" type="xs:boolean" use="optional"/><xs:attribute default="true" name="ignoreEmptyElements" type="xs:boolean" use="optional"/><xs:attribute name="updatecounter" type="xs:boolean" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="RetrieveContactCenterResponse"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="status" type="cmn:StatusType" use="required"/><xs:attribute name="message" type="xs:string" use="required"/><xs:attribute name="schemaRevisionDate" type="xs:date" use="required"/><xs:attribute name="schemaRevisionLevel" type="xs:int" use="required"/><xs:attribute name="returnCode" type="xs:decimal" use="optional"/><xs:attribute name="query" type="xs:string" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="more" type="xs:boolean" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="RetrieveContactCenterKeysListRequest"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/></xs:sequence><xs:attribute name="attachmentInfo" type="xs:boolean" use="optional"/><xs:attribute name="attachmentData" type="xs:boolean" use="optional"/><xs:attribute default="true" name="ignoreEmptyElements" type="xs:boolean" use="optional"/><xs:attribute name="updatecounter" type="xs:boolean" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="RetrieveContactCenterKeysListResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" name="keys" type="ContactCenterKeysType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="status" type="cmn:StatusType" use="required"/><xs:attribute name="message" type="xs:string" use="required"/><xs:attribute name="schemaRevisionDate" type="xs:date" use="required"/><xs:attribute name="schemaRevisionLevel" type="xs:int" use="required"/><xs:attribute name="returnCode" type="xs:decimal" use="optional"/><xs:attribute name="query" type="xs:string" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="more" type="xs:boolean" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="RetrieveContactCenterListRequest"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" name="keys" type="ContactCenterKeysType"/></xs:sequence><xs:attribute name="attachmentInfo" type="xs:boolean" use="optional"/><xs:attribute name="attachmentData" type="xs:boolean" use="optional"/><xs:attribute default="true" name="ignoreEmptyElements" type="xs:boolean" use="optional"/><xs:attribute name="updatecounter" type="xs:boolean" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/><xs:attribute name="attachmentType" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="RetrieveContactCenterListResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" name="instance" type="ContactCenterInstanceType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="status" type="cmn:StatusType" use="required"/><xs:attribute name="message" type="xs:string" use="required"/><xs:attribute name="schemaRevisionDate" type="xs:date" use="required"/><xs:attribute name="schemaRevisionLevel" type="xs:int" use="required"/><xs:attribute name="returnCode" type="xs:decimal" use="optional"/><xs:attribute name="query" type="xs:string" use="optional"/><xs:attribute name="handle" type="xs:string" use="optional"/><xs:attribute name="count" type="xs:long" use="optional"/><xs:attribute name="more" type="xs:boolean" use="optional"/><xs:attribute name="start" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="CreateContactCenterRequest"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/></xs:sequence><xs:attribute name="attachmentInfo" type="xs:boolean" use="optional"/><xs:attribute name="attachmentData" type="xs:boolean" use="optional"/><xs:attribute default="true" name="ignoreEmptyElements" type="xs:boolean" use="optional"/><xs:attribute default="-1" name="updateconstraint" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="CreateContactCenterResponse"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="status" type="cmn:StatusType" use="required"/><xs:attribute name="message" type="xs:string" use="required"/><xs:attribute name="schemaRevisionDate" type="xs:date" use="required"/><xs:attribute name="schemaRevisionLevel" type="xs:int" use="required"/><xs:attribute name="returnCode" type="xs:decimal" use="optional"/><xs:attribute name="query" type="xs:string" use="optional"/></xs:complexType></xs:element><xs:element name="UpdateContactCenterRequest"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/></xs:sequence><xs:attribute name="attachmentInfo" type="xs:boolean" use="optional"/><xs:attribute name="attachmentData" type="xs:boolean" use="optional"/><xs:attribute default="true" name="ignoreEmptyElements" type="xs:boolean" use="optional"/><xs:attribute default="-1" name="updateconstraint" type="xs:long" use="optional"/></xs:complexType></xs:element><xs:element name="UpdateContactCenterResponse"><xs:complexType><xs:sequence><xs:element name="model" type="ContactCenterModelType"/><xs:element minOccurs="0" name="messages" type="cmn:MessagesType"/></xs:sequence><xs:attribute name="status" type="cmn:StatusType" use="required"/><xs:attribute name="message" type="xs:string" use="required"/><xs:attribute name="schemaRevisionDate" type="xs:date" use="required"/><xs:attribute name="schemaRevisionLevel" type="xs:int" use="required"/><xs:attribute name="returnCode" type="xs:decimal" use="optional"/><xs:attribute name="query" type="xs:string" use="optional"/></xs:complexType></xs:element></xs:schema></types><message name="RetrieveContactCenterRequest"><part element="ns:RetrieveContactCenterRequest" name="RetrieveContactCenterRequest"/></message><message name="RetrieveContactCenterResponse"><part element="ns:RetrieveContactCenterResponse" name="RetrieveContactCenterResponse"/></message><message name="RetrieveContactCenterKeysListRequest"><part element="ns:RetrieveContactCenterKeysListRequest" name="RetrieveContactCenterKeysListRequest"/></message><message name="RetrieveContactCenterKeysListResponse"><part element="ns:RetrieveContactCenterKeysListResponse" name="RetrieveContactCenterKeysListResponse"/></message><message name="RetrieveContactCenterListRequest"><part element="ns:RetrieveContactCenterListRequest" name="RetrieveContactCenterListRequest"/></message><message name="RetrieveContactCenterListResponse"><part element="ns:RetrieveContactCenterListResponse" name="RetrieveContactCenterListResponse"/></message><message name="CreateContactCenterRequest"><part element="ns:CreateContactCenterRequest" name="CreateContactCenterRequest"/></message><message name="CreateContactCenterResponse"><part element="ns:CreateContactCenterResponse" name="CreateContactCenterResponse"/></message><message name="UpdateContactCenterRequest"><part element="ns:UpdateContactCenterRequest" name="UpdateContactCenterRequest"/></message><message name="UpdateContactCenterResponse"><part element="ns:UpdateContactCenterResponse" name="UpdateContactCenterResponse"/></message><portType name="ContactCenter"><operation name="RetrieveContactCenter"><documentation/><input message="ns:RetrieveContactCenterRequest"/><output message="ns:RetrieveContactCenterResponse"/></operation><operation name="RetrieveContactCenterKeysList"><documentation/><input message="ns:RetrieveContactCenterKeysListRequest"/><output message="ns:RetrieveContactCenterKeysListResponse"/></operation><operation name="RetrieveContactCenterList"><documentation/><input message="ns:RetrieveContactCenterListRequest"/><output message="ns:RetrieveContactCenterListResponse"/></operation><operation name="CreateContactCenter"><documentation/><input message="ns:CreateContactCenterRequest"/><output message="ns:CreateContactCenterResponse"/></operation><operation name="UpdateContactCenter"><documentation/><input message="ns:UpdateContactCenterRequest"/><output message="ns:UpdateContactCenterResponse"/></operation></portType><binding name="ContactCenter" type="ns:ContactCenter"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="RetrieveContactCenter"><soap:operation soapAction="Retrieve" style="document"/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output></operation><operation name="RetrieveContactCenterKeysList"><soap:operation soapAction="RetrieveKeysList" style="document"/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output></operation><operation name="RetrieveContactCenterList"><soap:operation soapAction="RetrieveList" style="document"/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output></operation><operation name="CreateContactCenter"><soap:operation soapAction="Create" style="document"/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output></operation><operation name="UpdateContactCenter"><soap:operation soapAction="Update" style="document"/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output></operation></binding><service name="ContactCenter"><port binding="ns:ContactCenter" name="ContactCenter"><soap:address location="https://motcsm.mirqab.gov.qa:13080/SM/7/ws"/></port></service></definitions>
